<template>
  <ve-histogram :data="chartData" :settings="chartSettings"></ve-histogram>
</template>

<script>
  export default {
    data () {
      this.chartSettings = {
        showLine: ['下单用户']
      }
      return {
        chartData: {
          columns: ['日期', '访问用户', '下单用户', '下单率'],
          rows: [
            { '日期': '1/1', '访问用户': 1393, '下单用户': 1093, '下单率': 0.32 },
            { '日期': '1/2', '访问用户': 3530, '下单用户': 3230, '下单率': 0.26 },
            { '日期': '1/3', '访问用户': 2923, '下单用户': 2623, '下单率': 0.76 },
            { '日期': '1/4', '访问用户': 1723, '下单用户': 1423, '下单率': 0.49 },
            { '日期': '1/5', '访问用户': 3792, '下单用户': 3492, '下单率': 0.323 },
            { '日期': '1/6', '访问用户': 4593, '下单用户': 4293, '下单率': 0.6 },
            { '日期': '1/7', '访问用户': 3458, '下单用户': 3450, '下单率': 0.54 },
            { '日期': '1/8', '访问用户': 1902, '下单用户': 2448, '下单率': 0.78 },
            { '日期': '1/9', '访问用户': 4009, '下单用户': 4550, '下单率': 0.36 },
            { '日期': '1/10', '访问用户': 3420, '下单用户': 3200, '下单率': 0.55 },
            { '日期': '1/11', '访问用户': 2009, '下单用户': 1904, '下单率': 0.43 },
            { '日期': '1/12', '访问用户': 4993, '下单用户': 4293, '下单率': 0.76},
          ]
        }
      }
    }
  }
</script>